; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v12 ?v4)
             (pred_9 ?v7 ?v11)
             (pred_2 ?v12 ?v11)
             (pred_12 ?v3 ?v12 )
	     (pred_6 ?v12)
             (pred_1 ?v2)
             (pred_8 ?v7)
             (pred_10 ?v11)
             (pred_4 ?v12)
             (pred_7 ?v7)
             (pred_11 ?v12)
             (pred_3 ))



(:action op_5
:parameters (?v10 ?v9 ?v6 ?v5)
:precondition (and (pred_1 ?v10) (pred_1 ?v9) (pred_8 ?v6) (pred_10 ?v5)
          (pred_5 ?v10 ?v9) (pred_9 ?v6 ?v5)
                   (pred_2 ?v9 ?v5) (pred_6 ?v10) 
                   (pred_4 ?v9) (pred_7 ?v6))
:effect (and  (pred_11 ?v9) (not (pred_4 ?v9))))


(:action op_4
:parameters (?v10 ?v13)
:precondition (and (pred_1 ?v10) (pred_1 ?v13)
               (pred_6 ?v10) (pred_5 ?v10 ?v13) (pred_11 ?v13))
:effect (and (pred_6 ?v13) (not (pred_6 ?v10))))

(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_1 ?v10) (pred_8 ?v6) 
                  (pred_6 ?v10) (pred_12 ?v6 ?v10) (pred_3 ))
:effect (and (pred_7 ?v6)
   (not (pred_12 ?v6 ?v10)) (not (pred_3 ))))


(:action op_3
:parameters (?v10 ?v1 ?v8)
:precondition (and (pred_1 ?v10) (pred_8 ?v1) (pred_8 ?v8)
                  (pred_6 ?v10) (pred_7 ?v8) (pred_12 ?v1 ?v10))
:effect (and (pred_7 ?v1) (pred_12 ?v8 ?v10)
        (not (pred_7 ?v8)) (not (pred_12 ?v1 ?v10))))

(:action op_2
:parameters (?v10 ?v6)
:precondition (and (pred_1 ?v10) (pred_8 ?v6) 
                  (pred_6 ?v10) (pred_7 ?v6))
:effect (and (pred_3 ) (pred_12 ?v6 ?v10) (not (pred_7 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_14 obj_09 obj_29 obj_19 obj_30 obj_20 obj_18 obj_10 obj_01 obj_23 obj_12 obj_16 obj_04 obj_25 obj_28 obj_24 obj_11 obj_17 obj_08 obj_07 obj_21 obj_02 obj_22 obj_26
    obj_05 obj_27
    obj_15 obj_13 obj_06
    )

    (:init
       (pred_3)

       (pred_1 obj_03)
       (pred_1 obj_14)
       (pred_1 obj_09)
       (pred_1 obj_29)
       (pred_1 obj_19)
       (pred_1 obj_30)
       (pred_1 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_23)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_04)
       (pred_1 obj_25)
       (pred_1 obj_28)
       (pred_1 obj_24)
       (pred_1 obj_11)
       (pred_1 obj_17)
       (pred_1 obj_08)
       (pred_1 obj_07)
       (pred_1 obj_21)
       (pred_1 obj_02)
       (pred_1 obj_22)
       (pred_1 obj_26)
       (pred_10 obj_05)
       (pred_10 obj_27)
       (pred_8 obj_15)
       (pred_8 obj_13)
       (pred_8 obj_06)

       (pred_5 obj_03 obj_30)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_09 obj_29)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_29 obj_10)
       (pred_5 obj_29 obj_19)
       (pred_5 obj_29 obj_09)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_19 obj_29)
       (pred_5 obj_30 obj_23)
       (pred_5 obj_30 obj_20)
       (pred_5 obj_30 obj_03)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_18)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_20 obj_30)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_20)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_29)
       (pred_5 obj_10 obj_18)
       (pred_5 obj_01 obj_25)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_23 obj_28)
       (pred_5 obj_23 obj_12)
       (pred_5 obj_23 obj_30)
       (pred_5 obj_12 obj_24)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_23)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_04 obj_25)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_25 obj_08)
       (pred_5 obj_25 obj_01)
       (pred_5 obj_25 obj_04)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_28 obj_23)
       (pred_5 obj_24 obj_21)
       (pred_5 obj_24 obj_11)
       (pred_5 obj_24 obj_12)
       (pred_5 obj_24 obj_28)
       (pred_5 obj_11 obj_02)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_11 obj_24)
       (pred_5 obj_17 obj_22)
       (pred_5 obj_17 obj_08)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_08 obj_26)
       (pred_5 obj_08 obj_25)
       (pred_5 obj_08 obj_17)
       (pred_5 obj_07 obj_21)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_21 obj_24)
       (pred_5 obj_21 obj_07)
       (pred_5 obj_02 obj_22)
       (pred_5 obj_02 obj_11)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_22 obj_26)
       (pred_5 obj_22 obj_17)
       (pred_5 obj_22 obj_02)
       (pred_5 obj_26 obj_08)
       (pred_5 obj_26 obj_22)
       (pred_4 obj_09)
       (pred_4 obj_23)
       (pred_4 obj_25)
       (pred_2  obj_09 obj_05)
       (pred_2  obj_23 obj_27)
       (pred_2  obj_25 obj_27)
       (pred_11 obj_03)
       (pred_11 obj_14)
       (pred_11 obj_29)
       (pred_11 obj_19)
       (pred_11 obj_30)
       (pred_11 obj_20)
       (pred_11 obj_18)
       (pred_11 obj_10)
       (pred_11 obj_01)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_04)
       (pred_11 obj_28)
       (pred_11 obj_24)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_21)
       (pred_11 obj_02)
       (pred_11 obj_22)
       (pred_11 obj_26)

       (pred_9  obj_15 obj_05)
       (pred_9  obj_13 obj_27)
       (pred_9  obj_06 obj_05)
       (pred_12 obj_15 obj_22)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_06 obj_04)
       (pred_6 obj_24)
    )

    (:goal (and
       (pred_12 obj_15 obj_08)
       (pred_12 obj_06 obj_14)
    ))
(:constraints
  (always (not (pred_6 obj_17)))
)
)

; plan
1. (op_4 obj_24 obj_12)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_12)
   goals met: 0 of 2
2. (op_4 obj_12 obj_16)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_16)
   goals met: 0 of 2
3. (op_4 obj_16 obj_04)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_04)
   goals met: 0 of 2
4. (op_1 obj_04 obj_06)
   deleted: (pred_12 obj_06 obj_04) (pred_3)
   added: (pred_7 obj_06)
   goals met: 0 of 2
5. (op_4 obj_04 obj_16)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_16)
   goals met: 0 of 2
6. (op_4 obj_16 obj_11)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_11)
   goals met: 0 of 2
7. (op_4 obj_11 obj_02)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_02)
   goals met: 0 of 2
8. (op_4 obj_02 obj_22)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_22)
   goals met: 0 of 2
9. (op_3 obj_22 obj_15 obj_06)
   deleted: (pred_7 obj_06) (pred_12 obj_15 obj_22)
   added: (pred_7 obj_15) (pred_12 obj_06 obj_22)
   goals met: 0 of 2
10. (op_4 obj_22 obj_26)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_26)
   goals met: 0 of 2
11. (op_4 obj_26 obj_08)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_08)
   goals met: 0 of 2
12. (op_2 obj_08 obj_15)
   deleted: (pred_7 obj_15)
   added: (pred_3) (pred_12 obj_15 obj_08)
   goals met: 1 of 2
13. (op_4 obj_08 obj_26)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_26)
   goals met: 1 of 2
14. (op_4 obj_26 obj_22)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_22)
   goals met: 1 of 2
15. (op_1 obj_22 obj_06)
   deleted: (pred_12 obj_06 obj_22) (pred_3)
   added: (pred_7 obj_06)
   goals met: 1 of 2
16. (op_4 obj_22 obj_02)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_02)
   goals met: 1 of 2
17. (op_4 obj_02 obj_11)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_11)
   goals met: 1 of 2
18. (op_4 obj_11 obj_16)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_16)
   goals met: 1 of 2
19. (op_4 obj_16 obj_18)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_18)
   goals met: 1 of 2
20. (op_4 obj_18 obj_20)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_20)
   goals met: 1 of 2
21. (op_4 obj_20 obj_14)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_14)
   goals met: 1 of 2
22. (op_2 obj_14 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_3) (pred_12 obj_06 obj_14)
   goals met: 2 of 2
